Sanskar-Dwivedi/SurakshaMarg-RealOne/hardware/wokwi_esp32/sketch.ino
/* A third lamp for one refusal in particular: the target is out of acoustic
 * range. Set to 0 if nothing is wired to GPIO26.
 *
 * Worth its own light because it is the one refusal that is about geometry
 * rather than about the animal. Lit, the three lamps read as a map - red too
 * close, green in range, this one too far - so moving a hand through the
 * detection cone tells the whole spatial story without a word of narration.
 *
 * The other four refusals share the red lamp. They are about who or what is
 * there, not where. */
/* A short audible chirp at the start of every emission.
 *
 * The carrier is 25 kHz and nobody in the room can hear it, so without this
 * the emitter contributes nothing an audience can perceive. The chirp is a
 * MARKER, not the carrier: 120 ms at 2.2 kHz, then the real 25 kHz burst runs
 * for its full length underneath.
 *
 * This is a demo affordance and has to be described as one. Saying "that beep
 * is the ultrasound" would be the one dishonest sentence in the whole project.
 * The boot banner declares it, and the right line is: the chirp tells you when
 * it emitted; what it actually emits, you cannot hear. */
#define AUDIBLE_MARKER 1
const uint32_t MARKER_HZ = 2200;
const uint16_t MARKER_MS = 120;

#define FAR_LAMP_MODE 1
const int LAMP_FAR = 26;      // yellow on this rig
bool farRefusal = false;

/* ---------------- LEDC ---------------- */
const int      LEDC_CH   = 0;
const int      LEDC_RES  = 8;          // 8-bit duty, 0..255
const uint32_t CARRIER_HZ = 25000;     // inside the documented 22-30 kHz band
const uint8_t  DUTY_PEAK = 128;        // 50% = maximum drive for a square carrier
const uint16_t RAMP_MS   = 25;         // raised-cosine rise and fall

/* ------------- governor limits, mirroring evidence.py ------------- */
const uint8_t  MAX_GROUP         = 3;
const uint32_t MAX_ACTIVATION_MS = 6000;
const uint32_t MIN_SILENCE_MS    = 20000;
const uint32_t DAILY_BUDGET_MS   = 120000;
const uint32_t ESCALATE_AFTER_MS = 25000;
const uint8_t  MAX_ATTEMPTS      = 3;
/* Live demos cannot wait 20 s between bursts, so the long timers are divided
 * by this and the true values are printed at boot - the compression is stated,
 * not hidden. Set to 4, not 10: at 10x, escalation fires 2.5 s after detection,
 * which is quicker than you can reach for a button, so every veto you try to
 * demonstrate has already gone to amber. Verified in the simulator.
 *
 * Lowered from 4 to 2 after watching someone use it. Compression shortens the
 * permitted burst as much as the waiting, and the burst is the only part that
 * is visible - at 4x it lasted 1.5 s and the rig looked like it only ever
 * refused. At 2x it is three seconds, which reads. The waits grow too, but
 * nobody is watching those. */
const uint16_t DEMO_SPEED        = 2;

/* One centimetre on the bench is one metre of field range. Chosen for the
 * demo rather than derived: at the old 2.8 the permit band sat between 34 and
 * 120 cm, which is a metre of desk and further than anyone naturally holds a
 * hand, so the rig looked like it only ever refused. At 1.0 the whole thing
 * fits inside arm's reach and the arithmetic is something you can say out loud
 * while it happens. */
const float DESK_SCALE  = 1.0;    // cm on the bench per metre of field range

/* Beyond this the bench sees nothing at all, rather than seeing something and
 * refusing it for being out of range. Without it a wall across the room is a
 * permanent detection the governor keeps declining, and the log fills with
 * refusals nobody caused. */
const float SEEN_MAX_CM = 70.0;
const float RANGE_MAX_M = 42.8;
const float LINE_M      = 12.0;

enum State { IDLE, TRACKING, EMITTING, COOLDOWN, ESCALATED, INHIBITED };
State state = IDLE;

uint32_t emitStartedAt = 0, lastEmissionEnd = 0, exposureUsedMs = 0;
uint32_t incidentStart = 0, lastBeat = 0, lastPrint = 0;
uint8_t  attempts = 0;
bool     doNotEmit = false, estopLatched = false, armedLed = false;

uint32_t scaled(uint32_t ms) { return ms / DEMO_SPEED; }

/* ---- LEDC portability shim: core 2.x and 3.x ----
 * ESP_ARDUINO_VERSION_MAJOR is undefined on very old cores, which the
 * preprocessor treats as 0, so the 2.x branch is the safe default. */
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
static inline void emitAttach()            { ledcAttach(PIN_EMIT, CARRIER_HZ, LEDC_RES); }
static inline void emitDuty(uint32_t duty) { ledcWrite(PIN_EMIT, duty); }
static inline void emitTone(uint32_t hz)   { ledcWriteTone(PIN_EMIT, hz); }
#else
static inline void emitAttach() {
  ledcSetup(LEDC_CH, CARRIER_HZ, LEDC_RES);
  ledcAttachPin(PIN_EMIT, LEDC_CH);
}
static inline void emitDuty(uint32_t duty) { ledcWrite(LEDC_CH, duty); }
static inline void emitTone(uint32_t hz)   { ledcWriteTone(LEDC_CH, hz); }
#endif

void emitStop();
float pingOnceCm();
void selfCheck();
void consoleHelp();
void consoleTick();
void consoleRun(char *, uint8_t);

/* ---------------- input conditioning ----------------
 *
 * Three noise sources, three specific demo failures:
 *
 *   button bounce   -> one glitch on a jumper latches the E-stop and the
 *                      emitter is dead for the rest of the presentation
 *   ADC noise       -> ESP32 ADC1 wanders by tens of counts while nothing
 *                      moves; the group-size threshold is an integer boundary,
 *                      so a still potentiometer flips PERMITTED / REFUSED
 *   sonar outliers  -> a real HC-SR04 throws a bad ping regularly, off soft
 *                      surfaces or while the previous burst is still ringing;
 *                      one of those reads as 'target lost' and resets the run
 *
 * None of this changes a single governor rule. It only stops the inputs from
 * lying to the rules.
 */

// A pin must agree with itself on this many consecutive passes to be believed.
const uint8_t DEBOUNCE_PASSES = 4;
const uint8_t GROUP_PASSES    = 3;
const uint8_t ADC_SAMPLES     = 16;
const uint8_t PING_GAP_MS     = 10;   // let the previous burst die down
const uint8_t CONSOLE_IDLE_MS = 80;   // dispatch a command with no terminator

const uint8_t B_PERSON = 0, B_NONTARGET = 1, B_ESTOP = 2, B_COUNT = 3;
int     btnPin[B_COUNT];
bool    btnStable[B_COUNT]    = {false, false, false};
bool    btnCandidate[B_COUNT] = {false, false, false};
uint8_t btnAgree[B_COUNT]     = {0, 0, 0};

bool pressed(uint8_t i) {
  bool raw = (digitalRead(btnPin[i]) == LOW);      // press-to-ground
  if (raw != btnCandidate[i]) { btnCandidate[i] = raw; btnAgree[i] = 0; }
  else if (btnAgree[i] < DEBOUNCE_PASSES) { btnAgree[i]++; }
  if (btnAgree[i] >= DEBOUNCE_PASSES) btnStable[i] = btnCandidate[i];
  return btnStable[i];
}

uint8_t groupStable = 1;
uint8_t groupTyped  = 1;        // used when no pot is fitted

uint8_t readGroup() {
#if !HAVE_POT
  return groupTyped;
#else
  uint32_t acc = 0;
  for (uint8_t i = 0; i < ADC_SAMPLES; i++) acc += analogRead(POT_GROUP);
  long    span = map((long)(acc / ADC_SAMPLES), 0L, 4095L, 1L, 8L);
  uint8_t want = (uint8_t)constrain(span, 1L, 8L);

