Sanskar-Dwivedi/SurakshaMarg-RealOne/hardware/wokwi_esp32/sketch.ino
  static uint8_t candidate = 1, agree = 0;
  if (want != candidate) { candidate = want; agree = 0; }
  else if (agree < GROUP_PASSES) { agree++; }
  if (agree >= GROUP_PASSES) groupStable = candidate;
  return groupStable;
#endif
}

/* ---------------- serial console ----------------
 *
 * Every physical input has a keyboard equivalent, for two reasons. A rig gets
 * built with parts that did not arrive, and a rig gets demonstrated in a room
 * where a jumper has shaken loose. Neither should cost you the argument, and
 * the argument is the refusals.
 *
 * Typing a veto is not the same claim as pressing one, so the console says
 * which it was in the log. Do not narrate a typed veto as a wired one.
 */
bool  typedPerson = false, typedNonTarget = false;
float simDistanceCm = 999.0f;

/* A typed distance overrides the sensor until the next reset.
 *
 * Without this, enabling the sensor silently disabled the console's d command:
 * it was still accepted and still acknowledged, and the governor went on
 * reading the sensor. Anything driving the board over USB - the web bench, for
 * instance - would appear to do nothing, while the log insisted the distance
 * had been set. An input that reports success and changes nothing is worse
 * than one that is missing.
 *
 * Cleared by r, so 'r' means "go back to trusting the sensor". */
bool  distanceOverride = false;

void consoleHelp() {
  Serial.println("console: g1..g8 group size | p person veto | n dog/goat veto");
  Serial.println("         e e-stop | r clear latches | ? this help");
#if HAVE_SENSOR
  Serial.println("         d0..d400 overrides the sensor until r, e.g. d25");
#else
  Serial.println("         d0..d400 distance in cm, e.g. d25 -> permitted");
#endif
#if !HAVE_POT
  Serial.println("         no pot fitted, so group size comes from g1..g8");
#endif
}

void consoleRun(char *line, uint8_t len) {
  char cmd = line[0];
  long arg = (len > 1) ? atol(line + 1) : -1;

  if (cmd == 'g') {
    if (arg >= 1 && arg <= 8) {
      groupTyped = (uint8_t)arg;
      Serial.printf("console: group size set to %u\n", groupTyped);
    } else {
      Serial.println("console: group size must be 1 to 8, e.g. g5");
    }
  } else if (cmd == 'd') {
    if (arg >= 0 && arg <= 400) {
      simDistanceCm = (float)arg;
      distanceOverride = true;          // stop reading the sensor until r
      Serial.printf("console: distance set to %ld cm (%.1f m scaled)\n",
                    arg, arg / DESK_SCALE);
    } else {
      Serial.println("console: distance must be 0 to 400 cm, e.g. d80");
    }
  } else if (cmd == 'p') {
    typedPerson = !typedPerson;
    Serial.printf("console: PERSON veto %s (typed, not wired)\n",
                  typedPerson ? "on" : "off");
  } else if (cmd == 'n') {
    typedNonTarget = !typedNonTarget;
    Serial.printf("console: DOG/GOAT veto %s (typed, not wired)\n",
                  typedNonTarget ? "on" : "off");
  } else if (cmd == 'e') {
    estopLatched = true;
    Serial.println("console: E-STOP asserted");
  } else if (cmd == 'r') {
    /* Clear the typed vetoes too.
     *
     * They are toggles, so anything driving this console - a person or the web
     * page - has no way to read their state, only to flip them. A reset that
     * leaves them set means the driver's model and the board disagree from the
     * first command onward, and every later toggle stays inverted. Reset has
     * to mean reset, or it is just another source of drift. */
    estopLatched = false;
    doNotEmit = false;
    typedPerson = false;
    typedNonTarget = false;
    distanceOverride = false;      // back to the sensor
    exposureUsedMs = 0;
    state = IDLE;
    attempts = 0;
    incidentStart = 0;
    Serial.println("console: latches cleared");
  } else if (cmd == '?') {
    consoleHelp();
  } else {
    Serial.printf("console: unknown command '%s', try ?\n", line);
  }
}

void consoleTick() {
  /* Two ways a command gets here, because the Serial Monitor has a line-ending
   * dropdown and it is not the operator's job to know about it.
   *
   * Set to "New Line" it sends p\n and the newline dispatches. Set to "No Line
   * Ending" it sends a bare p and nothing follows, so a parser that waits for a
   * terminator waits forever and the console looks broken. That is a real
   * regression I shipped: character-by-character parsing handled the bare p,
   * line buffering did not.
   *
   * So: dispatch on the newline if one arrives, and otherwise on a short
   * silence. A human cannot type two commands 80 ms apart, and the monitor
   * sends a whole line in one burst, so the silence is unambiguous. */
  static char line[24];
  static uint8_t n = 0;
  static uint32_t lastChar = 0;

  while (Serial.available() > 0) {
    int c = Serial.read();
    lastChar = millis();
    if (c == '\\r') continue;
    if (c != '\\n') {
      if (n < sizeof(line) - 1) line[n++] = (char)c;
      continue;
    }
    line[n] = 0;
    uint8_t len = n;
    n = 0;
    if (len > 0) consoleRun(line, len);
  }

  if (n > 0 && (millis() - lastChar) > CONSOLE_IDLE_MS) {
    line[n] = 0;
    uint8_t len = n;
    n = 0;
    consoleRun(line, len);
  }
}

void setup() {
  pinMode(PIN_TRIG, OUTPUT);
  pinMode(PIN_ECHO, INPUT);
  pinMode(LED_PERMIT, OUTPUT);
  pinMode(LED_REFUSE, OUTPUT);
  pinMode(LED_ESCALATE, OUTPUT);
  pinMode(LED_ARMED, OUTPUT);
  pinMode(BTN_PERSON, INPUT_PULLUP);
  pinMode(BTN_NONTARGET, INPUT_PULLUP);
  pinMode(BTN_ESTOP, INPUT);        // GPIO35 has no internal pull-up: add 10k to 3V3
  btnPin[B_PERSON]    = BTN_PERSON;
  btnPin[B_NONTARGET] = BTN_NONTARGET;
  btnPin[B_ESTOP]     = BTN_ESTOP;

  emitAttach();
  emitDuty(0);

  Serial.begin(115200);
  delay(200);
  Serial.println();
  Serial.println("GauKavach bench governor - ESP32");
  Serial.println("========================================");
  Serial.printf("carrier          %lu Hz, %d-bit duty, raised-cosine %d ms ramp\n",
                (unsigned long)CARRIER_HZ, LEDC_RES, RAMP_MS);
  Serial.printf("max activation   %.1f s   (demo %.1f s)\n",
                MAX_ACTIVATION_MS / 1000.0, scaled(MAX_ACTIVATION_MS) / 1000.0);
  Serial.printf("quiet period     %.1f s   (demo %.1f s)\n",
                MIN_SILENCE_MS / 1000.0, scaled(MIN_SILENCE_MS) / 1000.0);
  Serial.printf("daily budget     %.1f s   (demo %.1f s)\n",
                DAILY_BUDGET_MS / 1000.0, scaled(DAILY_BUDGET_MS) / 1000.0);
  Serial.printf("max group        %d\n", MAX_GROUP);
  Serial.println("timers compressed for the demo; shipped values shown first");
  Serial.println("NO calibrated mic attached: this rig makes no dB claim");
  Serial.println();
  selfCheck();
  consoleHelp();
  Serial.println();
}

