Sanskar-Dwivedi/SurakshaMarg-RealOne/hardware/wokwi_esp32/sketch.ino
/* Power-on self check.
 *
 * A governor made of refusals cannot tell you it is miswired: a floating
 * E-stop latches, a dead sensor reads as "nothing there", and both look
 * exactly like the system working correctly and declining to emit. Every
 * silent failure mode in this rig presents as a deliberate refusal, so the
 * inputs get examined once at boot, before the logic can hide behind them. */
void selfCheck() {
  Serial.println("power-on self check");

#if HAVE_ESTOP
  uint8_t lows = 0;
  for (uint8_t i = 0; i < 40; i++) {
    if (digitalRead(BTN_ESTOP) == LOW) lows++;
    delay(5);
  }
  if (lows == 0) {
    Serial.println("  E-stop input    OK, held high");
  } else if (lows == 40) {
    Serial.println("  E-stop input    STUCK LOW - button held closed, or both its "
                   "wires are on the same side of the switch");
  } else {
    Serial.printf("  E-stop input    FLOATING (%u of 40 samples low) - the 10k "
                  "pull-up to 3V3 is not connected\n", lows);
  }
#else
  const uint8_t lows = 0;
  Serial.println("  E-stop input    NOT FITTED - the wired stop is disabled; "
                 "console 'e' still latches");
#endif

#if HAVE_SENSOR
  uint8_t echoes = 0;
  for (uint8_t i = 0; i < 5; i++) {
    if (pingOnceCm() > 0) echoes++;
    delay(60);
  }
  if (echoes > 0) {
    Serial.printf("  distance sensor OK, %u of 5 pings returned\n", echoes);
  } else {
    Serial.println("  distance sensor NO ECHO - check VCC is on VIN/5V not 3V3, "
                   "and that TRIG and ECHO are not swapped");
  }
#else
  const uint8_t echoes = 1;
  Serial.println("  distance sensor NOT FITTED - distance comes from the "
                 "console, type d80");
#endif

#if !HAVE_POT
  Serial.println("  group knob      NOT FITTED - group size comes from the "
                 "console, type g5");
#else
  uint32_t acc = 0;
  for (uint8_t i = 0; i < 16; i++) acc += analogRead(POT_GROUP);
  Serial.printf("  group knob      reads %lu of 4095\n",
                (unsigned long)(acc / 16));
#endif

  if (lows > 0 || echoes == 0) {
    Serial.println("  ^ fix the above before reading anything into a refusal");
  }
#if !HAVE_ESTOP || !HAVE_SENSOR || !HAVE_POT
  Serial.println();
  Serial.println("  DECLARE THIS WHEN YOU DEMONSTRATE:");
#if !HAVE_SENSOR
  Serial.println("    the distance input is typed, not sensed");
#endif
#if !HAVE_POT
  Serial.println("    the group size is typed, not read from a knob");
#endif
#if !HAVE_ESTOP
  Serial.println("    the emergency stop is a console command, not a wired button");
#endif
#if ONE_LAMP_MODE
  Serial.println("    one lamp, not three: solid means emitting, a slow pulse "
                 "means refused, a fast flutter means it gave up");
#elif TWO_LAMP_MODE && FAR_LAMP_MODE
  Serial.println("    lamps: green permits, red refuses, red blinking is "
                 "escalation, yellow is out of acoustic range");
#elif TWO_LAMP_MODE
  Serial.println("    two lamps, not three: green permits, red refuses, "
                 "red blinking is escalation");
#endif
  Serial.println("    the governor rules below are unchanged and are doing the deciding");
#endif
  Serial.println();
}

/* Raised-cosine rise. Blocking for RAMP_MS, which is acceptable here because
 * nothing else needs servicing during a 25 ms envelope, and it keeps the shape
 * identical to emitter.py rather than approximated by a scheduler. */
void emitStart() {
#if AUDIBLE_MARKER
  /* Marker first, then the real carrier. Deliberately before the ramp, so the
   * envelope that follows is untouched by it. */
  emitTone(MARKER_HZ);
  delay(MARKER_MS);
  emitTone(0);
  emitAttach();                 // back to CARRIER_HZ after the tone changed it
#endif
  for (uint16_t t = 0; t <= RAMP_MS; t++) {
    float x = (float)t / RAMP_MS;                 // 0..1
    float e = 0.5f * (1.0f - cosf(PI * x));       // raised cosine
    emitDuty((uint32_t)(DUTY_PEAK * e));
    delay(1);
  }
  emitDuty(DUTY_PEAK);
}

void emitFade() {
  for (uint16_t t = 0; t <= RAMP_MS; t++) {
    float x = (float)t / RAMP_MS;
    float e = 0.5f * (1.0f + cosf(PI * x));       // mirror of the rise
    emitDuty((uint32_t)(DUTY_PEAK * e));
    delay(1);
  }
  emitDuty(0);
}

void emitStop(const char *why) {
  if (state == EMITTING) {
    emitFade();
    uint32_t dur = millis() - emitStartedAt;
    exposureUsedMs += dur;
    lastEmissionEnd = millis();
    Serial.printf("  emission ended after %lu ms - %s\n", (unsigned long)dur, why);
    if (exposureUsedMs >= scaled(DAILY_BUDGET_MS)) {
      doNotEmit = true;
      Serial.println("  DAILY EXPOSURE BUDGET EXHAUSTED -> do-not-emit latched");
    }
  }
  emitDuty(0);
}

float pingOnceCm() {
  digitalWrite(PIN_TRIG, LOW);  delayMicroseconds(2);
  digitalWrite(PIN_TRIG, HIGH); delayMicroseconds(10);
  digitalWrite(PIN_TRIG, LOW);
  unsigned long us = pulseIn(PIN_ECHO, HIGH, 25000UL);
  if (us == 0) return -1.0f;            // no echo != "animal is adjacent"
  return us / 58.0f;
}

/* Median of three. One bad ping cannot move the answer, and the no-echo case
 * still wins when two of three agree on it - which is the behaviour we want,
 * because 'nothing there' has to stay easy to conclude. */
float readRangeCm() {
  float a = pingOnceCm(); delay(PING_GAP_MS);
  float b = pingOnceCm(); delay(PING_GAP_MS);
  float c = pingOnceCm();
  float hi = max(a, max(b, c));
  float lo = min(a, min(b, c));
  return a + b + c - hi - lo;
}

#if ONE_LAMP_MODE
/* One lamp, three states, told apart by rate. */
void leds(bool p, bool r, bool e) {
  uint32_t ms = millis();
  bool on;
  if (p)      on = true;                        // emitting: solid
  else if (e) on = ((ms / 120) % 2) == 0;       // escalated: fast flutter
  else if (r) on = ((ms / 500) % 2) == 0;       // refusing: slow pulse
  else        on = false;                       // nothing detected
  digitalWrite(LAMP_ONE, on);
}
#elif TWO_LAMP_MODE
/* Two working lamps instead of three.
 *
 * Three states, two lights, so escalation has to be distinguishable from a
 * refusal by something other than colour: it blinks. */
void leds(bool p, bool r, bool e) {
  digitalWrite(LAMP_GO, p);
  bool blink = ((millis() / 250) % 2) == 0;
#if FAR_LAMP_MODE
  /* A range refusal lights yellow and only yellow. Sharing red would leave the
   * three zones as two colours, and the point of the third lamp is that the
   * distance reads without narration: red too close, green in range, yellow
   * too far. Escalation still owns blinking red, whatever the reason was. */
  digitalWrite(LAMP_STOP, e ? blink : (r && !farRefusal));
  digitalWrite(LAMP_FAR, farRefusal && !e);
#else
  digitalWrite(LAMP_STOP, e ? blink : r);
#endif
}
#else
void leds(bool p, bool r, bool e) {
  digitalWrite(LED_PERMIT, p);
  digitalWrite(LED_REFUSE, r);
  digitalWrite(LED_ESCALATE, e);
}
#endif

void loop() {
  uint32_t now = millis();

  /* Sample every input on every pass, before any early return. A debounce
   * counter that only advances while a target is present is worse than none:
   * a veto button already held down when the animal walks in would need four
   * more passes to be believed, and the governor would permit emission in the
   * gap. Safety inputs must be settled before they are needed, not after. */
  consoleTick();
  farRefusal = false;          // set below only by the out-of-range refusal
  bool person    = pressed(B_PERSON)    || typedPerson;
  bool nonTarget = pressed(B_NONTARGET) || typedNonTarget;
  uint8_t group  = readGroup();

#if HAVE_ESTOP
  if (pressed(B_ESTOP)) estopLatched = true;
#endif
  if (estopLatched) {
    emitStop("E-STOP");
    state = INHIBITED;
    leds(false, true, false);
    digitalWrite(LED_ARMED, LOW);
    if (now - lastPrint > 1000) {
      Serial.println("E-STOP LATCHED - emitter dead until reset");
      lastPrint = now;
    }
    return;
  }

  if (now - lastBeat > 900) { lastBeat = now; armedLed = !armedLed; digitalWrite(LED_ARMED, armedLed); }

